hacUPB/micro-2420-eval-u3-JeronimoQ107/twrke18fProject3_ftm_simple_pwm/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v16.0
processor: MKE18F512xxx16
package_id: MKE18F512VLL16
mcu_data: ksdk2_0
processor_version: 13.0.1
pin_labels:
- {pin_num: '50', pin_signal: PTC12/FTM3_CH6/FTM2_CH6, label: PTC12, identifier: PTC12}
- {pin_num: '49', pin_signal: PTC13/FTM3_CH7/FTM2_CH7, label: PTC13, identifier: PTC13}
- {pin_num: '46', pin_signal: ADC0_SE12/ACMP2_IN5/PTC14/FTM1_CH2, label: PTC14, identifier: PTC14}
- {pin_num: '45', pin_signal: ADC0_SE13/ACMP2_IN4/PTC15/FTM1_CH3, label: PTC15, identifier: PTC15}
- {pin_num: '25', pin_signal: PTD13/FTM2_CH4/RTC_CLKOUT, label: PTD13, identifier: PTD13}
- {pin_num: '24', pin_signal: PTD14/FTM2_CH5/CLKOUT, label: PTD14, identifier: PTD14}
- {pin_num: '22', pin_signal: ACMP2_IN1/PTD15/FTM0_CH0, label: PTD15, identifier: PTD15}
- {pin_num: '21', pin_signal: ACMP2_IN0/PTD16/FTM0_CH1, label: PTD16, identifier: PTD16}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '54', peripheral: LPUART0, signal: RX, pin_signal: ADC0_SE4/ADC1_SE14/PTB0/LPUART0_RX/LPSPI0_PCS0/LPTMR0_ALT3/PWT_IN3}
  - {pin_num: '53', peripheral: LPUART0, signal: TX, pin_signal: ADC0_SE5/ADC1_SE15/PTB1/LPUART0_TX/LPSPI0_SOUT/TCLK0}
  - {pin_num: '50', peripheral: GPIOC, signal: 'GPIO, 12', pin_signal: PTC12/FTM3_CH6/FTM2_CH6, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '49', peripheral: GPIOC, signal: 'GPIO, 13', pin_signal: PTC13/FTM3_CH7/FTM2_CH7, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '46', peripheral: GPIOC, signal: 'GPIO, 14', pin_signal: ADC0_SE12/ACMP2_IN5/PTC14/FTM1_CH2, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '45', peripheral: GPIOC, signal: 'GPIO, 15', pin_signal: ADC0_SE13/ACMP2_IN4/PTC15/FTM1_CH3, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '25', peripheral: GPIOD, signal: 'GPIO, 13', pin_signal: PTD13/FTM2_CH4/RTC_CLKOUT, direction: INPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '24', peripheral: GPIOD, signal: 'GPIO, 14', pin_signal: PTD14/FTM2_CH5/CLKOUT, direction: INPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '22', peripheral: GPIOD, signal: 'GPIO, 15', pin_signal: ACMP2_IN1/PTD15/FTM0_CH0, direction: INPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '21', peripheral: GPIOD, signal: 'GPIO, 16', pin_signal: ACMP2_IN0/PTD16/FTM0_CH1, direction: INPUT, pull_select: up, pull_enable: enable}
  - {pin_num: '51', peripheral: FTM3, signal: 'CH, 5', pin_signal: PTC11/FTM3_CH5}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Clock Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Clock Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

    gpio_pin_config_t PTC12_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC12 (pin 50)  */
    GPIO_PinInit(BOARD_INITPINS_PTC12_GPIO, BOARD_INITPINS_PTC12_PIN, &PTC12_config);

    gpio_pin_config_t PTC13_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC13 (pin 49)  */
    GPIO_PinInit(BOARD_INITPINS_PTC13_GPIO, BOARD_INITPINS_PTC13_PIN, &PTC13_config);

    gpio_pin_config_t PTC14_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC14 (pin 46)  */
    GPIO_PinInit(BOARD_INITPINS_PTC14_GPIO, BOARD_INITPINS_PTC14_PIN, &PTC14_config);

    gpio_pin_config_t PTC15_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC15 (pin 45)  */
    GPIO_PinInit(BOARD_INITPINS_PTC15_GPIO, BOARD_INITPINS_PTC15_PIN, &PTC15_config);

    gpio_pin_config_t PTD13_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD13 (pin 25)  */
    GPIO_PinInit(BOARD_INITPINS_PTD13_GPIO, BOARD_INITPINS_PTD13_PIN, &PTD13_config);

    gpio_pin_config_t PTD14_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD14 (pin 24)  */
    GPIO_PinInit(BOARD_INITPINS_PTD14_GPIO, BOARD_INITPINS_PTD14_PIN, &PTD14_config);

    gpio_pin_config_t PTD15_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD15 (pin 22)  */
    GPIO_PinInit(BOARD_INITPINS_PTD15_GPIO, BOARD_INITPINS_PTD15_PIN, &PTD15_config);

    gpio_pin_config_t PTD16_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD16 (pin 21)  */
    GPIO_PinInit(BOARD_INITPINS_PTD16_GPIO, BOARD_INITPINS_PTD16_PIN, &PTD16_config);

    /* PORTB0 (pin 54) is configured as LPUART0_RX */
    PORT_SetPinMux(PORTB, 0U, kPORT_MuxAlt2);

    /* PORTB1 (pin 53) is configured as LPUART0_TX */
    PORT_SetPinMux(PORTB, 1U, kPORT_MuxAlt2);

    /* PORTC11 (pin 51) is configured as FTM3_CH5 */
    PORT_SetPinMux(PORTC, 11U, kPORT_MuxAlt2);

    /* PORTC12 (pin 50) is configured as PTC12 */
    PORT_SetPinMux(BOARD_INITPINS_PTC12_PORT, BOARD_INITPINS_PTC12_PIN, kPORT_MuxAsGpio);

    /* PORTC13 (pin 49) is configured as PTC13 */
    PORT_SetPinMux(BOARD_INITPINS_PTC13_PORT, BOARD_INITPINS_PTC13_PIN, kPORT_MuxAsGpio);

    /* PORTC14 (pin 46) is configured as PTC14 */
    PORT_SetPinMux(BOARD_INITPINS_PTC14_PORT, BOARD_INITPINS_PTC14_PIN, kPORT_MuxAsGpio);

    /* PORTC15 (pin 45) is configured as PTC15 */
    PORT_SetPinMux(BOARD_INITPINS_PTC15_PORT, BOARD_INITPINS_PTC15_PIN, kPORT_MuxAsGpio);

    /* PORTD13 (pin 25) is configured as PTD13 */
    PORT_SetPinMux(BOARD_INITPINS_PTD13_PORT, BOARD_INITPINS_PTD13_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[13] = ((PORTD->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTD14 (pin 24) is configured as PTD14 */
    PORT_SetPinMux(BOARD_INITPINS_PTD14_PORT, BOARD_INITPINS_PTD14_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[14] = ((PORTD->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTD15 (pin 22) is configured as PTD15 */
    PORT_SetPinMux(BOARD_INITPINS_PTD15_PORT, BOARD_INITPINS_PTD15_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[15] = ((PORTD->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTD16 (pin 21) is configured as PTD16 */
    PORT_SetPinMux(BOARD_INITPINS_PTD16_PORT, BOARD_INITPINS_PTD16_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[16] = ((PORTD->PCR[16] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
